Revit 2027 API
ParameterTypeId.ThermalMaterialParamPorosity Property
 "Porosity"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ThermalMaterialParamPorosity { get; }
Public Shared ReadOnly Property ThermalMaterialParamPorosity As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ThermalMaterialParamPorosity {
	ForgeTypeId^ get ();
}
static member ThermalMaterialParamPorosity : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace